package org.example;

import com.google.gson.Gson;

public class Main {

    // Задача 3. Дана json строка (можно сохранить в файл и читать из файла)
// (Коллеги, если сложно будет распарсить .json -> можно работать как со строкой обычной)
// [{"фамилия":"Иванов","оценка":"5","предмет":"Математика"},
// {"фамилия":"Петрова","оценка":"4","предмет":"Информатика"},
// {"фамилия":"Краснов","оценка":"5","предмет":"Физика"}]
// Написать метод(ы), который распарсит json и, используя StringBuilder, создаст строки вида:
// Студент [фамилия] получил [оценка] по предмету [предмет].
// Пример вывода:
// Студент Иванов получил 5 по предмету Математика.
// Студент Петрова получил 4 по предмету Информатика.
// Студент Краснов получил 5 по предмету Физика.

    static class Student {
        String фамилия;
        String оценка;
        String предмет;
        public Student (String фамилия, String оценка, String предмет){
            this.фамилия = фамилия;
            this.оценка= оценка;
            this.предмет=предмет;
        }
    }

    public static void main(String[] args) {
        String [] jsonText = new String[3];
        jsonText[0] = "{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"}";
        jsonText[1] = "{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"}";
        jsonText[2] = "{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}";


        Gson gson = new Gson();

        for(int i = 0; i< jsonText.length; i++){
            Student student = gson.fromJson(jsonText[i], Student.class);
            System.out.println("Студент "+ student.фамилия+" "+"получил(а) "+student.оценка
            +" "+"по предмету "+student.предмет+".");


    }
}
}